var app = new Vue({
	el: '#app',
	data: {
		stu_name: "黄金超",
		lesson_name: "Scratch_Pre1",
		lesson_names: [
			"Scratch_Pre1",
			"Scratch_Pre2",
			"Scratch_Pre3",
			"Scratch_Pre4",
			"Scratch_Level1",
			"Scratch_Level2",
			"Scratch_Level3",
			"Scratch_Level4",
			"C++_Basic",
			"C++_Level",
			"Python"
		],
		lesson_content: [],
		lesson_contents: {
			"C++_Basic": [
				{
					title: "输入输出",
					content: "输入输出"
				},
				{
					title: "条件分支",
					content: "条件分支"
				},
				{
					title: "while循环",
					content: "while循环"
				},
				{
					title: "for循环",
					content: "for循环"
				},
				{
					title: "变量与数据类型",
					content: "变量与数据类型"
				},
				{
					title: "基础算法总结",
					content: "基础算法总结"
				},
				{
					title: "三种运算符",
					content: "三种运算符"
				},
				{
					title: "循环应用",
					content: "循环应用"
				},
				{
					title: "一维数组",
					content: "一维数组"
				},
				{
					title: "二维数组",
					content: "二维数组"
				},
				{
					title: "字符串",
					content: "字符串"
				},
				{
					title: "数组应用（一）",
					content: "数组应用（一）"
				},
				{
					title: "数组应用（二）",
					content: "数组应用（二）"
				},
				{
					title: "格式化输入输出",
					content: "格式化输入输出"
				},
				{
					title: "阶段性复习",
					content: "阶段性复习"
				},
				{
					title: "枚举法",
					content: "枚举法"
				},
				{
					title: "函数",
					content: "函数"
				},
				{
					title: "函数应用",
					content: "函数应用"
				},
				{
					title: "递归",
					content: "递归"
				},
				{
					title: "线性数据结构",
					content: "线性数据结构"
				},
				{
					title: "简单排序算法",
					content: "简单排序算法"
				},
				{
					title: "文件与结构体",
					content: "文件与结构体"
				},
				{
					title: "树",
					content: "树"
				},
				{
					title: "数据结构复习",
					content: "数据结构复习"
				},
				{
					title: "组合数学初步",
					content: "组合数学初步"
				},
				{
					title: "阅读程序专题",
					content: "阅读程序专题"
				},
				{
					title: "完善程序专题",
					content: "完善程序专题"
				},
				{
					title: "程序的时空复杂度",
					content: "程序的时空复杂度"
				},
				{
					title: "计算机基础知识（原码 反码 补码）",
					content: "计算机基础知识（原码 反码 补码）"
				},
				{
					title: "计算机基础知识（硬件 软件 网络）",
					content: "计算机基础知识（硬件 软件 网络）"
				},
				{
					title: "计算机基础知识（进制转换）",
					content: "计算机基础知识（进制转换）"
				},
			],
			"C++_Level": [
				{
					title: "C++ Level test title",
					content: "C++ Level test content"
				},
			],
			"Scratch_Pre1": [
				{
					title: "1.蜗牛吃草莓",
					content: "蜗牛吃草莓，主要内容为：编写程序让蜗牛能自动前进和转向，从而吃到各种路线上的草莓"
				},
				{
					title: "2.甲壳虫吃水果",
					content: "甲壳虫吃水果，主要内容为：实现用键盘按键控制甲壳虫上下左右移动。甲壳虫需要躲避危险，吃到食物"
				},
				{
					title: "3.龟兔赛跑 ",
					content: "龟兔赛跑。 本节课的主要内容为:用Scratch编程制作龟兔赛跑的动画，还原龟兔赛跑这个寓言故事"
				},
				{
					title: "4.旅行企鹅",
					content: "旅行企鹅，主要内容为：用坐标变化的方式让企鹅上下左右自由运动。企鹅会在旅行中遇到很多有趣的角色"
				},
				{
					title: "5.冰火世界",
					content: "冰火世界，主要内容为：完成一个综合性的游戏项目创作"
				},
				{
					title: "1.神奇的画笔",
					content: "神奇的画笔，主要内容为：初步认识并使用Scratch中的画笔工具，编写程序画出正方形、三角形、旋转正方形等图形"
				},
				{
					title: "2.秘密花园",
					content: "秘密花园，主要内容为：绘制图形，绘制背景。用编程的方式创作好看的美术作品《秘密花园》"
				},
				{
					title: "3.水晶矿工",
					content: "水晶矿工，主要内容为：用坐标控制怪物在固定线路上来回运动，奥小白跟随鼠标移动并采集矿石"
				},
				{
					title: "4.克隆孙悟空",
					content: "克隆孙悟空，主要内容为：用克隆制作出酷炫动画，孙悟空复制出许多自己，并让克隆的孙悟空围成圈保护师父"
				},
				{
					title: "5.打地鼠",
					content: "打地鼠，主要内容为：制作综合性项目，打地鼠游戏，学习用编程实现“棒槌打到老鼠”的判断"
				}],
			"Scratch_Pre2": [
				{
					title: "1星际穿越",
					content: "星际穿越，主要内容为：制作一个星际穿越的动画，飞船经过时空之门，穿越到星光灿烂的宇宙星空"
				},
				{
					title: "2小猴子接水果",
					content: "小猴子接水果，主要内容为：用克隆和随机的知识让水果从舞台上方随机落下，小猴子在树下左右移动接住水果"
				},
				{
					title: "3消灭气球课件",
					content: "消灭气球课件，主要内容为：制作趣味游戏，气球从舞台下方随机出现，用鼠标碰到气球从而消灭气球"
				},
				{
					title: "4小鸟追踪",
					content: "小鸟追踪，主要内容为：鼠标碰到小鸟，小鸟就移动到随机位置。如果在1秒内没有追踪到小鸟，小鸟爆炸"
				},
				{
					title: "5听话的奥小白",
					content: "听话的奥小白，主要内容为：制作互动问答作品，用询问回答的方式让奥小白听从命令，做对应的事情"
				},
				{
					title: "1幸运转盘",
					content: "幸运转盘，主要内容为：用程序制作一个幸运转盘，转盘旋转抽奖，抽中奖项后出现对于奖品"
				},
				{
					title: "2足球守门员",
					content: "足球守门员，主要内容为：制作一个点球大战游戏。控制守门员挡住随机方向射来的足球"
				},
				{
					title: "3口算达人",
					content: "口算达人，主要内容为：用程序制作一个计算器，计算器可以实现的四则运算功能"
				},
				{
					title: "4扫雷",
					content: "扫雷，主要内容为：制作一个扫雷游戏。用距离探测实现扫雷功能"
				},
				{
					title: "5心跳小游戏",
					content: "心跳小游戏，主要内容为：1. 学会用大小增减实现心跳效果2. 复习和巩固克隆知识3. 综合应用条件判断"
				}],
			"Scratch_Pre3": [
				{
					title: "1爆炸的小鸟",
					content: "爆炸的小鸟，主要内容为：用按键控制挡板左右运动，挡板需要挡住小球，用小球去撞击小鸟"
				},
				{
					title: "2秘密花园2",
					content: "秘密花园2，主要内容为：用程序完成美术作品，在原有秘密花园的基础上，加上随机斑点效果"
				},
				{
					title: "3赛车游戏1",
					content: "赛车游戏1，主要内容为：复习克隆知识，用克隆实现糖果雨从天上掉落的动画效果"
				},
				{
					title: "4赛车游戏2",
					content: "赛车游戏2，主要内容为：初步完成赛车游戏脚本，赛车左右移动，在马路上超车，并且收集奖励品"
				},
				{
					title: "5赛车游戏3",
					content: "赛车游戏3，主要内容为：提升赛车游戏脚本，学习游戏设计中完整性、趣味性、平衡性等游戏设计理念"
				},
				{
					title: "6听话的八戒",
					content: "听话的八戒，主要内容为：制作一个趣味互动作品，猪八戒的眼睛会看向鼠标，鼻子会变大，睡觉会打呼噜"
				},
				{
					title: "7字母消消乐",
					content: "字母消消乐，主要内容为：26个英文字母从舞台上方随机掉落，按键盘上对应的字母按键就可以消除字母"
				},
				{
					title: "8马里奥1",
					content: "超级马里奥1，主要内容为：用相对运动的方式，让背景土地运动，实现马里奥走路"
				},
				{
					title: "9马里奥2",
					content: "超级马里奥2，主要内容为：完成马里奥的跳跃和灌木丛的克隆"
				},
				{
					title: "10马里奥3",
					content: "超级马里奥3，主要内容为：完成马里奥大型脚本的创作。完善得分、生命值等功能"
				}],
			"Scratch_Pre4": [
				{
					title: "1畅通无阻",
					content: "畅通无阻，主要内容为：完成询问脚本，不同回答会引起不同事件时使用的条件判断是否需要重复执行"
				},
				{
					title: "2笨鸟快飞",
					content: "笨鸟快飞，主要内容为：实现按下空格键小鸟向上，不按则会下落，利用相对运动实现小鸟向右飞行，再添加判断失败的脚本"
				},
				{
					title: "3方方正正（1）",
					content: "方方正正（1），主要内容为：实现鼠标触碰到正方形则外观改变，否则回到原来样子；当角色被点击时，广播游戏开始"
				},
				{
					title: "4方方正正（2）",
					content: "方方正正（2），主要内容为：实现按键控制正方形上下左右运动，假如吃到从舞台上方随机位置下落的小球，则得分加1"
				},
				{
					title: "5方方正正（3）",
					content: "方方正正（3），主要内容为：当小球掉落至警戒线，则出现掉血特效；当生命值小于0时，游戏失败，出现失败特效；当得分大于80时游戏胜利，出现胜利特效"
				},
				{
					title: "6小金走世界",
					content: "小金走世界，主要内容为：实现空格控制小金跳跃，每隔随机描述出现障碍物，假如跳过则加分，否则扣分"
				},
				{
					title: "7疯狂的水果（1）",
					content: "疯狂的水果（1），主要内容为：条件判断实现角色不断切换造型，直到切换为满足条件的造型时克隆自己；克隆体利用重力系统上抛下落"
				},
				{
					title: "8疯狂的水果（2）",
					content: "疯狂的水果（2），主要内容为：当鼠标被按下时画线，且边画线，边清空；添加模式按钮实现按下不同按钮时以不同方式清算积分"
				},
				{
					title: "9圣诞树上的礼物",
					content: "圣诞树上的礼物，主要内容为：使用询问并等待积木结合变量控制圣诞树礼物出现的顺序"
				}
			],
			"Scratch_Level1": [
				{
					title: "1.钢琴大师",
					content: "钢琴大师，主要内容为：用编程制作一个弹钢琴的项目。按左右移动键控制角色在钢琴上运动，按空格键弹奏"
				},
				{
					title: "2.随机涂鸦",
					content: "随机涂鸦，主要内容为：用编程绘制有趣图案。点击绿旗之后，角色根据隐藏的造型，画出相应的图案"
				},
				{
					title: "3. 激光法师",
					content: "激光法师，主要内容为：用编程制作一个趣味项目，激光法师发射激光打击怪物"
				},
				{
					title: "4.地下迷宫",
					content: "地下迷宫，主要内容为：用按键控制勇士上下左右，穿越障碍物的阻挡，最后得到水晶"
				},
				{
					title: "5.动画制作",
					content: "动画制作，主要内容为：完成一个综合性的项目，用编程独立制作动画"
				},
				{
					title: "1海底世界",
					content: "海底探险，主要内容为：制作一个海底世界的趣味作品。鱼和章鱼在海底游动，经过放大镜时，动物变大"
				},
				{
					title: "2荒漠历险",
					content: "荒漠历险，主要内容为：制作一个历险类互动作品。奥小白来到荒漠历险，发射种子在荒漠生长，将荒漠变回绿洲"
				},
				{
					title: "3胡言乱语的机器人",
					content: "胡言乱语的机器人，主要内容为：编写程序，实现机器人的胡言乱语。机器人会从列表中随机取出主语、谓语等，组成一句话"
				},
				{
					title: "4电子钢琴",
					content: "电子钢琴，主要内容为：用程序制作一个自动弹奏的电子钢琴。预先把乐谱存入列表，用程序弹奏乐谱"
				},
				{
					title: "5保卫地球",
					content: "保卫地球，主要内容为：使用本单元内容完成综合性项目"
				}
			],
			"Scratch_Level2": [
				{
					title: "1小白小卖部",
					content: "小白小卖部，主要内容为：用编程制作一个绘画美术项目。用编程画出螺旋线的棒棒糖和果汁机里的果汁"
				},
				{
					title: "2图章绘画",
					content: "图章绘画，主要内容为：用编程中的图章功能绘制图案,创作美术作品"
				},
				{
					title: "3小白拍球",
					content: "小白拍球，主要内容为：用编程制作一个趣味项目，奥小白用图章拍下掌印，如果拍中小球就胜利"
				},
				{
					title: "4奥小白捕鱼",
					content: "奥小白捕鱼，主要内容为：用按键控制锚发射，锚从水里抓住水中的鱼"
				},
				{
					title: "5记忆游戏",
					content: "记忆游戏，主要内容为：完成一个综合性的猜造型的项目。随机出现5个奥小白，奥小白一闪而过，之后询问某个造型是否出现过"
				},
				{
					title: "1会思考的小车",
					content: "会思考的小车，主要内容为：结合无人驾驶，用编程让小车自动运行"
				},
				{
					title: "2小小变色龙",
					content: "小小变色龙，主要内容为：模拟变色龙的效果，制作一个趣味小游戏，变色龙碰到颜色就变成相应的颜色，躲避敌人，吃到水果"
				},
				{
					title: "3冰火星球",
					content: "冰火星球，主要内容为：编写程序，完成游戏作品。按下空格键发射飞艇，让飞艇能在冰火星球成功降落"
				},
				{
					title: "4逃离双子星",
					content: "逃离双子星。本节课的主要内容为用程序制作一个趣味游戏，按左右键控制角色移动，躲避从上方掉落下来的石块"
				},
				{
					title: "5击退入侵者	",
					content: "击退入侵者，主要内容为： 1. 学习复杂的条件分支结构2.学会用私有变量控制单个克隆体3.学习游戏设计的平衡性理念"
				}
			],
			"Scratch_Level3": [
				{
					title: "1桌面门球",
					content: "桌面门球，主要内容为：用编程制作一个趣味项目，奥小白要将不同颜色的球打进对应颜色的球门里"
				},
				{
					title: "2剑侠大战冰妖（1）",
					content: "剑侠大战冰妖（1），主要内容为：用编程制作一个游戏项目，剑侠用飞剑攻击冰妖。并要用飞剑挡住冰妖的冰块攻击"
				},
				{
					title: "3剑侠大战冰妖（2）",
					content: "剑侠大战冰妖（2），主要内容为：完善游戏项目，学习项目设计理念"
				},
				{
					title: "4航海射箭1",
					content: "航海射箭1，主要内容为：按照脚本功能，独立完成部分脚本编写"
				},
				{
					title: "5航海射箭2",
					content: "航海射箭2，主要内容为：独立完成完整项目创作"
				},
				{
					title: "1果子保卫战",
					content: "果子保卫战，主要内容为：完成一个趣味游戏项目。蚂蚁由按键控制上下左右移动，躲避蚂蚱，保卫果子"
				},
				{
					title: "2雪山历险记",
					content: "雪山历险记，主要内容为：奥小白来到雪山历险，头顶的乌云会掉下冰雹，奥小白边跳跃边躲避冰雹"
				},
				{
					title: "3音乐梦想秀1",
					content: "音乐梦想秀1，主要内容为：用编程制作一下可以用键盘弹奏的钢琴"
				},
				{
					title: "4音乐梦想秀2",
					content: "音乐梦想秀2，主要内容为：给钢琴加上自动播放功能。玩家弹奏完毕之后，钢琴能把玩家之前弹奏的乐曲播放出来"
				},
				{
					title: "5盲画人脸",
					content: "盲画人脸，主要内容为：用编程完成一个有趣的盲画人脸作品。按下鼠标开始画人脸，但画的时候看不到笔迹，画完之后再自动打印出来"
				}
			],
			"Scratch_Level4": [
				{
					title: "1农场偷菜",
					content: "农场偷菜，主要内容为：农场的机器人会发射射线扫描整个农场。兔子上下左右移动躲避射线，获得萝卜"
				},
				{
					title: "2小小侦查员1",
					content: "小小侦查员1，主要内容为：奥小白作为侦查员，需要拿到钥匙才能闯关成功，它需要躲避敌人的追踪"
				},
				{
					title: "3小小侦查员2",
					content: "小小侦查员2，主要内容为：完善程序，并用广播实现闯关功能"
				},
				{
					title: "4潜艇出击1",
					content: "潜艇出击1，主要内容为：根据提供的角色，自主设计故事和游戏。并独立完成部分脚本编写"
				},
				{
					title: "5潜艇出击2",
					content: "潜艇出击2，主要内容为：独立完成全部脚本"
				},
				{
					title: "1冰原大冒险",
					content: "冰原大冒险，主要内容为：奥小白来到冰原进行冒险，它需要踩破对应于关数的冰块数，并获得水晶"
				},
				{
					title: "2盲道请注意",
					content: "盲道请注意，主要内容为：奥小白用扫描的方式侦测两边道路，实现自动行走"
				},
				{
					title: "3贪吃蛇",
					content: "贪吃蛇，主要内容为：用Scratch制作一个贪吃蛇游戏"
				},
				{
					title: "4烈焰小飞龙",
					content: "烈焰小飞龙，主要内容为：设计一个综合性项目，并开始进行程序编写"
				},

			],
			"Python": [
				{
					title: "Python test title",
					content: "Python test content"
				},
			],
		},
		show_comment: [],
		show_comments_bads: [
			"今天又迟到了",
			"作业没有认真完成",
			"作业没有写",
			"不是很自信",
			"不太认真，精神不太好",
			"上课时常常走神",
			"比较安静，默默听课",
			"上课时喜欢讨论课外内容"
		],
		show_comments_goods: [
			"会积极的参与和尝试",
			"很乐观",
			"编程基础很好",
			"思维活跃",
			"很有想法",
			"有很多自己的思考",
			"听课很认真",
			"一如既然的稳定与聪明",
			"能够灵活使用之前学过的内容",
			"紧跟老师节奏，能理解并实现课上内容",
			"积极举手回答老师的问题",
			"会积极的参与到课堂中",
			"非常认真听讲，精神非常好",
			"会在抢答中享受竞争和学习的乐趣",
			"能一直跟着老师的讲解积极思考",
			"提出了很多很有意思的问题"
		],
		final_comment: [],
		final_comments: [
			"非常棒，继续加油！",
			"表现得不太好，后面请继续加油哟~",
			"下一节课要努力一点点哟~"
		]
	}
})